In [1]:
!bq --location=US mk --dataset imdb_modeled

Dataset 'swift-area-266618:imdb_modeled' successfully created.

In [27]:
%%bigquery
create table imdb_modeled.Movies as 
select distinct *
from imdb_staging.Movies

Empty DataFrame
Columns: []
Index: []

In [28]:
%%bigquery
create table imdb_modeled.Ratings as 
select distinct *
from imdb_staging.Ratings

Empty DataFrame
Columns: []
Index: []

In [64]:
%%bigquery
CREATE table imdb_modeled.Actors AS
SELECT * EXCEPT(primary_profession, job, ordering, actors, production_company, place_of_death, reason_of_death, imdb_name_id, date_of_death), date_of_death as reason_of_death, generate_uuid() as actor_name_id
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "actor"

Empty DataFrame
Columns: []
Index: []

In [2]:
%%bigquery
CREATE table imdb_modeled.Directors AS
SELECT * EXCEPT(primary_profession, job, actors, production_company, ordering, place_of_death, reason_of_death, imdb_name_id, date_of_death), generate_uuid() as director_name_id, date_of_death as reason_of_death
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "director"

Empty DataFrame
Columns: []
Index: []

In [3]:
%%bigquery
CREATE table imdb_modeled.Writers AS
SELECT * EXCEPT(primary_profession, job, actors, production_company, ordering, place_of_death, reason_of_death, imdb_name_id, date_of_death), generate_uuid() as writer_name_id, date_of_death as reason_of_death
FROM imdb_staging.Names n INNER JOIN imdb_staging.Title_Principals t USING (imdb_name_id)
WHERE t.category = "writer"

Empty DataFrame
Columns: []
Index: []

In [2]:
%%bigquery
CREATE table imdb_modeled.Actor_Movie AS
SELECT * EXCEPT(ordering, category, job)
FROM imdb_staging.Title_Principals
WHERE category = "actor"

Empty DataFrame
Columns: []
Index: []

In [3]:
%%bigquery
CREATE table imdb_modeled.Writer_Movie AS
SELECT * EXCEPT(ordering, category, job, characters)
FROM imdb_staging.Title_Principals
WHERE category = "writer"

Empty DataFrame
Columns: []
Index: []

In [4]:
%%bigquery
CREATE table imdb_modeled.Director_Movie AS
SELECT * EXCEPT(ordering, category, job, characters)
FROM imdb_staging.Title_Principals
WHERE category = "director"

Empty DataFrame
Columns: []
Index: []

In [9]:
%%bigquery
select cast(date_of_birth as date) as date_of_birth
from imdb_modeled.Names

Executing query with job ID: 44c21943-131f-43fb-8728-2033f8e160c6
Query executing: 0.21s

ERROR:
 404 Not found: Table swift-area-266618:imdb_modeled.Names was not found in location US

(job ID: 44c21943-131f-43fb-8728-2033f8e160c6)

            -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_of_birth as date) as date_of_birth
   2:from imdb_modeled.Names
    |    .    |    .    |    .    |    .    |    .    |

In [8]:
%%bigquery
select cast(date_of_death as date) as date_of_death
from imdb_modeled.Actors

Executing query with job ID: 5804af48-7ea8-4051-9a18-c0feff006b78
Query executing: 0.27s

ERROR:
 404 Not found: Table swift-area-266618:imdb_modeled.Names was not found in location US

(job ID: 5804af48-7ea8-4051-9a18-c0feff006b78)

            -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_of_death as date) as date_of_death
   2:from imdb_modeled.Names
    |    .    |    .    |    .    |    .    |    .    |

In [7]:
%%bigquery
select cast(usa_gross_income as INT64) as usa_gross_income
from imdb_modeled.Movies

Executing query with job ID: 54c72928-e341-4c90-9603-0a1b4563e0bb
Query executing: 0.96s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/54c72928-e341-4c90-9603-0a1b4563e0bb?location=US&timeoutMs=400&maxResults=0: Bad int64 value: $ 69225

(job ID: 54c72928-e341-4c90-9603-0a1b4563e0bb)

                -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(usa_gross_income as INT64) as usa_gross_income
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |

In [6]:
%%bigquery
select cast(worlwide_gross_income as INT64) as worlwide_gross_income
from imdb_modeled.Movies

Executing query with job ID: 51b09a88-e80d-4701-9ca4-a94fec4f9510
Query executing: 0.49s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/51b09a88-e80d-4701-9ca4-a94fec4f9510?location=US&timeoutMs=0&maxResults=0: Bad int64 value: $ 67522

(job ID: 51b09a88-e80d-4701-9ca4-a94fec4f9510)

                     -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(worlwide_gross_income as INT64) as worlwide_gross_income
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |    .    |

In [4]:
%%bigquery
select cast(birth_year as INT64) as birth_year
from imdb_modeled.Actors
order by birth_year

        birth_year
0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
...            ...
100490      2006.0
100491      2006.0
100492      2007.0
100493      2007.0
100494      2008.0

[100495 rows x 1 columns]

In [5]:
%%bigquery
select cast(death_year as INT64) as death_year
from imdb_modeled.Actors
order by death_year

        death_year
0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
...            ...
100490      2019.0
100491      2019.0
100492      2019.0
100493      2019.0
100494      2019.0

[100495 rows x 1 columns]

In [10]:
%%bigquery
select cast(date_published as date) as date_published
from imdb_modeled.Movies

Executing query with job ID: 06ec3589-9f96-4fea-8f10-c0cc50ea6e87
Query executing: 0.51s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/06ec3589-9f96-4fea-8f10-c0cc50ea6e87?location=US&timeoutMs=400&maxResults=0: Invalid date: '1979'

(job ID: 06ec3589-9f96-4fea-8f10-c0cc50ea6e87)

             -----Query Job SQL Follows-----

    |    .    |    .    |    .    |    .    |    .    |
   1:select cast(date_published as date) as date_published
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |    .    |    .    |

In [13]:
%%bigquery
select cast(budget as INT64) as budget
from imdb_modeled.Movies

Executing query with job ID: d509993b-0a99-4b22-868e-f71579f55374
Query executing: 0.33s

ERROR:
 400 GET https://bigquery.googleapis.com/bigquery/v2/projects/swift-area-266618/queries/d509993b-0a99-4b22-868e-f71579f55374?location=US&timeoutMs=400&maxResults=0: Bad int64 value: GBP 80000

(job ID: d509993b-0a99-4b22-868e-f71579f55374)

      -----Query Job SQL Follows-----

    |    .    |    .    |    .    |
   1:select cast(budget as INT64) as budget
   2:from imdb_modeled.Movies
    |    .    |    .    |    .    |

### Queries for checking duplicates in primary key

Writers Table

In [6]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Writers

     f0_
0  55867

In [7]:
%%bigquery
SELECT COUNT(DISTINCT writer_name_id) FROM imdb_modeled.Writers

     f0_
0  55867

Actors Table

In [4]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Actors

      f0_
0  100495

In [5]:
%%bigquery
SELECT COUNT(DISTINCT actor_name_id) FROM imdb_modeled.Actors

      f0_
0  100495

In [3]:
%%bigquery
SELECT COUNT(*)
FROM imdb_modeled.Movies r LEFT JOIN imdb_modeled.Actors m ON r.imdb_title_id = m.imdb_title_id
WHERE m.imdb_title_id IS NULL

     f0_
0  43210

In [8]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Actor_Movie

      f0_
0  100495

In [10]:
%%bigquery
SELECT COUNT(DISTINCT imdb_name_id) FROM imdb_modeled.Actor_Movie

     f0_
0  45174

Directors Table

In [20]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Directors

     f0_
0  40106

In [21]:
%%bigquery
SELECT COUNT(DISTINCT director_name_id) FROM imdb_modeled.Directors

     f0_
0  40106

In [1]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Ratings

     f0_
0  81273

In [2]:
%%bigquery
SELECT COUNT(DISTINCT imdb_title_id) FROM imdb_modeled.Ratings

     f0_
0  81273

In [10]:
%run Actors_beam.py

/home/jupyter/venv/lib/python3.5/site-packages/apache_beam/io/gcp/bigquery.py:1421: BeamDeprecationWarning: options is deprecated since First stable release. References to <pipeline>.options will not be supported
  experiments = p.options.view_as(DebugOptions).experiments or []
INFO:apache_beam.runners.direct.direct_runner:Running pipeline with DirectRunner.
INFO:oauth2client.transport:Refreshing due to a 401 (attempt 1/2)
INFO:apache_beam.io.gcp.bigquery_tools:Using location 'US' from table <TableReference
 datasetId: 'imdb_modeled'
 projectId: 'swift-area-266618'
 tableId: 'Actors'> referenced by query SELECT name, birth_name, height, bio, birth_details, birth_year, place_of_birth, death_details, death_year, spouses, divorces, children, known_for_titles, imdb_title_id, actor_name_id, category, characters, reason_of_death FROM imdb_modeled.Actors WHERE birth_year IS NOT NULL AND death_year IS NOT NULL limit 50
WARNING:apache_beam.io.gcp.bigquery_tools:Dataset swift-area-266618:temp_dataset_c972e1aff99c4133bf0a40cfffbe1b43 does not exist so we will create it as temporary with location=US
INFO:apache_beam.io.gcp.bigquery_tools:Created table swift-area-266618.imdb_modeled.Actors_Beam with schema <TableSchema
 fields: [<TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'name'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_name'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'height'
 type: 'FLOAT'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'bio'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_details'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_year'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'place_of_birth'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'death_details'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'death_year'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'spouses'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'divorces'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'children'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'known_for_titles'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'imdb_title_id'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'category'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'characters'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'reason_of_death'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'actor_name_id'
 type: 'STRING'>]>. Result: <Table
 creationTime: 1583126126565
 etag: 'TB0rF3/Csk66G1SHl5bxcw=='
 id: 'swift-area-266618:imdb_modeled.Actors_Beam'
 kind: 'bigquery#table'
 lastModifiedTime: 1583126126604
 location: 'US'
 numBytes: 0
 numLongTermBytes: 0
 numRows: 0
 schema: <TableSchema
 fields: [<TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'name'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_name'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'height'
 type: 'FLOAT'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'bio'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_details'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'birth_year'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'place_of_birth'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'death_details'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'death_year'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'spouses'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'divorces'
 type: 'INTEGER'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'children'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'known_for_titles'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'imdb_title_id'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'category'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'characters'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'reason_of_death'
 type: 'STRING'>, <TableFieldSchema
 fields: []
 mode: 'NULLABLE'
 name: 'actor_name_id'
 type: 'STRING'>]>
 selfLink: 'https://www.googleapis.com/bigquery/v2/projects/swift-area-266618/datasets/imdb_modeled/tables/Actors_Beam'
 tableReference: <TableReference
 datasetId: 'imdb_modeled'
 projectId: 'swift-area-266618'
 tableId: 'Actors_Beam'>
 type: 'TABLE'>.
WARNING:apache_beam.io.gcp.bigquery_tools:Sleeping for 150 seconds before the write as BigQuery inserts can be routed to deleted table for 2 mins after the delete and create.
INFO:apache_beam.io.filebasedsink:Starting finalize_write threads with num_shards: 1 (skipped: 0), batches: 1, num_threads: 1
INFO:apache_beam.io.filebasedsink:Renamed 1 shards in 0.10 seconds.
INFO:apache_beam.io.filebasedsink:Starting finalize_write threads with num_shards: 1 (skipped: 0), batches: 1, num_threads: 1
INFO:apache_beam.io.filebasedsink:Renamed 1 shards in 0.10 seconds.

Actors_bream table - Primary Key Verification

In [11]:
%%bigquery
SELECT COUNT(*) FROM imdb_modeled.Actors_Beam

   f0_
0   50

In [12]:
%%bigquery
SELECT COUNT(DISTINCT actor_name_id) FROM imdb_modeled.Actors_Beam

   f0_
0   50

Actors_bream table - Not child table so no Foreign Key Verification. Table has no foreign keys.